CP3046/jcu_collaborative_research_portal_v2/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
INSERT INTO "comments" ("body", "created_at", "post_id", "researcher_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "dfd"], ["created_at", Wed, 07 Sep 2011 07:59:09 UTC +00:00], ["post_id", 1], ["researcher_id", 1], ["updated_at", Wed, 07 Sep 2011 07:59:09 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])