CP3046/jcu_collaborative_research_portal_v2/app/controllers/posts_controller.rb

  def index
    respond_to do |format|
      format.html {
        @posts = Post.search(params[:search_title], params[:search_tags], params[:page])
---
SELECT "posts".* FROM "posts" WHERE (title like '%%') LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE (title like '%%')

  def create
    @post = Post.new(params[:post])
    @post.researcher = logged_in_researcher

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "researcher_id", "slug", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "hihoih"], ["created_at", Wed, 07 Sep 2011 07:59:04 UTC +00:00], ["researcher_id", 1], ["slug", "iohio"], ["title", "iohio"], ["updated_at", Wed, 07 Sep 2011 07:59:04 UTC +00:00]]