CP3046/jcu_collaborative_research_portal_v2/app/controllers/researchers_controller.rb

SELECT "researchers".* FROM "researchers" WHERE (name like '%%') ORDER BY name ASC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "researchers" WHERE (name like '%%')
---
  def index
    respond_to do |format|
      format.html { # index.html.erb
        @researchers = Researcher.search(params[:search_name], params[:page])

SELECT "posts".* FROM "posts" WHERE "posts"."researcher_id" = 1
SELECT "researchers".* FROM "researchers" WHERE "researchers"."id" = ? LIMIT 1  [["id", "j"]]
---
  def account
    respond_to do |format|
      format.html { redirect_to @researcher }
      format.xml  { render :xml => @researcher }
      format.json { render :json => @researcher }
      format.rss  {
        @display_posts = {}

        for post in Post.all(:limit => RSS_ITEM_LIMIT, :order => "created_at DESC")
          commented_on_post = false
          commented_on_post = post.comments.select { |comment| comment.researcher == @researcher }.any?

INSERT INTO "researchers" ("created_at", "email", "jc_number", "moderator", "name", "profile_image_content_type", "profile_image_file_name", "profile_image_file_size", "slug", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @researcher = Researcher.new(params[:researcher])

    respond_to do |format|
      if @researcher.save

UPDATE "researchers" SET "profile_image_file_name" = '19_yr_old_male_profile.jpeg', "profile_image_content_type" = 'image/jpeg', "profile_image_file_size" = 6257, "profile_image_updated_at" = '2011-09-06 13:12:07.604548', "updated_at" = '2011-09-06 13:12:07.968239' WHERE "researchers"."id" = 1
---
  def update
    @researcher = Researcher.find(params[:id])

    respond_to do |format|
      if @researcher.update_attributes(params[:researcher])