CP3046/app/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE ("comments".post_id = 1)
---
<h2>Comments</h2>
<% @post.comments.each do |comment| %>