CP3046/jcu_collaborative_research_portal_v2/app/views/posts/show.html.erb

<div class='comments'>
  <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1