CP3046/app/app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment])
		@comment.researcher = logged_in_researcher

		if @comment.save
			redirect_to post_path(@post), :notice => "Comment was successfully added."
		else
			redirect_to post_path(@post), :alert => "Failed to add comment: #{@comment.errors.full_messages.join(', ')}"
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
INSERT INTO "comments" ("body", "researcher_id", "post_id", "created_at", "updated_at") VALUES ('aaa', NULL, 1, '2011-04-26 12:50:24.989811', '2011-04-26 12:50:24.989811')
SELECT "comments".* FROM "comments" WHERE ("comments".post_id = 1)
SELECT "researchers".* FROM "researchers" WHERE ("researchers"."id" = 1) LIMIT 1

  def destroy
    @comment.destroy
---
DELETE FROM "comments" WHERE ("comments"."id" = 980190962)