CP3046/app/app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE ("groups"."id" = 980190962) LIMIT 1
---
  def show
    @group = Group.find(params[:id])

SELECT "groups".* FROM "groups" WHERE ("groups"."id" = 980190962) LIMIT 1
---
  def edit
    @group = Group.find(params[:id])

INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES ('MyNewGroup', '2011-05-01 02:59:53.094755', '2011-05-01 02:59:53.094755')
---
  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save

SELECT "groups".* FROM "groups" WHERE ("groups"."id" = 980190962) LIMIT 1
---
  def update
    @group = Group.find(params[:id])

SELECT "groups".* FROM "groups" WHERE ("groups"."id" = 980190962) LIMIT 1
DELETE FROM "groups" WHERE ("groups"."id" = 980190962)
---
  def destroy
    @group = Group.find(params[:id])
    @group.destroy