CP3046/app/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title like '%vvvsdafsdf%') ORDER BY updated_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE (title like '%%')
---
  def index
	respond_to do |format|
      format.html {
	    # index.html.erb
		@posts= Post.paginate :page => params[:page], :order => 'updated_at DESC'

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
---
  def show
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO "posts" ("title", "content", "researcher_id", "created_at", "updated_at") VALUES ('bbb', 'bbb', NULL, '2011-04-26 11:24:51.372451', '2011-04-26 11:24:51.372451')
---
  def create
    @post = Post.new(params[:post])
	@post.researcher = logged_in_researcher

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
UPDATE "posts" SET "title" = 'My post title', "updated_at" = '2011-03-07 08:57:08.084772' WHERE ("posts"."id" = 1)
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 980190962) LIMIT 1
DELETE FROM "posts" WHERE ("posts"."id" = 980190962)
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy