CP3046/app/app/controllers/researchers_controller.rb

  def index
    respond_to do |format|
      format.html { # index.html.erb
#		@researchers = Researcher.paginate :page => params[:page], :order => 'updated_at DESC'
		@researchers = Researcher.search(params[:search_name], params[:page])
---
SELECT "researchers".* FROM "researchers" WHERE ("researchers"."name" = 'Joe') LIMIT 1

	def posts
		@researcher = Researcher.find(params[:id])
---
SELECT "researchers".* FROM "researchers" WHERE ("researchers"."id" = 980190962) LIMIT 1