CP3046/app/app/controllers/researchers_controller.rb

  def index
    respond_to do |format|
      format.html { # index.html.erb
		@researchers = Researcher.paginate :page => params[:page], :order => 'updated_at DESC'
---
SELECT "researchers".* FROM "researchers" WHERE (name like '%%') ORDER BY updated_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "researchers" WHERE (name like '%%')

  def show
    @researcher = Researcher.find(params[:id])
---
SELECT "researchers".* FROM "researchers" WHERE ("researchers"."id" = 1) LIMIT 1

  def account
    @researcher = Researcher.find(params[:id])
---
SELECT "researchers".* FROM "researchers" WHERE ("researchers"."id" = 15) LIMIT 1

  def research
    @researcher = Researcher.find(params[:id])
---
SELECT "researchers".* FROM "researchers" WHERE ("researchers"."id" = 15) LIMIT 1

  def edit
    @researcher = Researcher.find(params[:id])
---
SELECT "researchers".* FROM "researchers" WHERE ("researchers"."id" = 1) LIMIT 1

  def profile
    @researcher = Researcher.find(params[:id])
---
SELECT "researchers".* FROM "researchers" WHERE ("researchers"."id" = 1) LIMIT 1

  def update
    @researcher = Researcher.find(params[:id])

	# Only allow the user to change the details of the researcher, if the researcher is the current user.
  	if logged_in_researcher == @researcher
		respond_to do |format|
		  if @researcher.update_attributes(params[:researcher])
---
SELECT "researchers".* FROM "researchers" WHERE ("researchers"."id" = 3) LIMIT 1
UPDATE "researchers" SET "name" = 'Robert', "title" = '', "updated_at" = '2011-03-11 13:36:53.765481' WHERE ("researchers"."id" = 1)